cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'caskroom/fonts'

# Formulae
brew 'ack'
brew 'bash'
brew 'bash-completion'
brew 'coreutils'
brew 'findutils'
brew 'fzf'
brew 'gawk'  # improves tmux-fingers
brew 'gcc'
brew 'git'
brew 'highlight'
brew 'httpie'
brew 'hub'
brew 'lynx'
brew 'nano'
brew 'python'
brew 'python3'
brew 'readline'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'reattach-to-user-namespace'  # copy-paste for tmux
brew 'vim'
brew 'wget'
brew 'z'

# Applications
cask 'alfred'
cask 'appcleaner'
cask 'bettertouchtool'
cask 'dropbox'
cask 'exa'
cask 'flux'
cask 'github'
cask 'google-chrome'
cask 'handbrake'
cask 'skype'
cask 'spectacle'
cask 'sublime-text3'
cask 'totalterminal'
cask 'transmission'
cask 'vlc'

# Quick Look plugins
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'suspicious-package'

# Color pickers
cask 'colorpicker-developer'
cask 'colorpicker-skalacolor'

# Fonts
cask 'font-open-sans'
cask 'font-source-code-pro'
cask 'font-cousine'
