# Applications
alfred
appcleaner
bettertouchtool
dropbox
exa
flux
github
google-chrome
handbrake
skype
spectacle
sublime-text3
totalterminal
transmission
vlc

# Quick Look plugins
qlcolorcode
qlimagesize
qlmarkdown
qlstephen
suspicious-package

# Color pickers
colorpicker-developer
colorpicker-skalacolor

# Fonts
font-open-sans
font-source-code-pro
